frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `firstname`, `lastname`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('test', 'Jose', 'Perez', 'test@test.com', '$2y$13$eUtxb19wtzDYrGoaDVMo1ezu4N7rUoUwkU5IKTPAsaGVTF6OfEzEi', 'm48w-0mSyk_uBS9ylaR45cCn9DJGES5a', 10, 1431638277, 1431638277)
---
    public function signup()
    {
        if ($this->validate()) {
            $user = new User();
            $user->username = $this->username;
            $user->firstname = $this->firstname;
            $user->lastname = $this->lastname;
            $user->email = $this->email;
            $user->setPassword($this->password);
            $user->generateAuthKey();
            if ($user->save()) {